In [1]:
import pandas as pd
myfile = 'kpop_idols.csv'
df = pd.read_csv(myfile)

### 단순 index 대한 범위 선택

In [3]:
df[:3]

,Stage Name,Full Name,Korean Name,K. Stage Name,Date of Birth,Group,Country,Birthplace,Other Group,Gender
0,A.M,Seong Hyunwoo,성현우,에이엠,1996-12-31,Limitless,South Korea,NaN,NaN,M
1,Ace,Jang Wooyoung,장우영,에이스,1992-08-28,VAV,South Korea,NaN,NaN,M
2,Aeji,Kwon Aeji,권애지,애지,1999-10-25,Hashtag,South Korea,Daegu,NaN,F

### loc & iloc

- loc

In [5]:
df.loc[:, ['Korean Name', 'Date of Birth']]

     Korean Name Date of Birth
0            성현우    1996-12-31
1            장우영    1992-08-28
2            권애지    1999-10-25
3            이아인    1999-09-27
4            고아라    2001-02-21
...          ...           ...
1305         박희준    1997-06-16
1306         배진예    1994-06-09
1307         조혜원    2005-05-31
1308         백주호    1996-07-04
1309         김주미    1994-12-08

[1310 rows x 2 columns]

In [8]:
df.loc[3:8, ['Korean Name', 'Date of Birth']]
# 끝 범위를 포함하는 것을 주의하라!!

  Korean Name Date of Birth
3         이아인    1999-09-27
4         고아라    2001-02-21
5         조자영    1991-05-26
6         강아형    1996-08-27
7         이예진    1989-05-30
8         김희정    1991-07-13

- iloc (position으로 색인)

In [9]:
df.iloc[1:3, [1, 3]]
# 끝 범위를 포함하지 않는다!

       Full Name K. Stage Name
1  Jang Wooyoung           에이스
2      Kwon Aeji            애지